# 03 dataFrame 사용해보기

In [3]:
import pandas as pd

In [4]:
two_dimensional_list = [
    ['dongwook',50,86],
    ['sineui',89,31],
    ['ikjoong',68,91],
    ['yoonsoo',88,75]
]

In [5]:
my_df = pd.DataFrame(two_dimensional_list)
my_df

          0   1   2
0  dongwook  50  86
1    sineui  89  31
2   ikjoong  68  91
3   yoonsoo  88  75

아주 이쁜 표다 ㅎㅎ

datatype 을 출력해보자

In [6]:
type(my_df)

pandas.core.frame.DataFrame

인덱스 rows 와 collum 의 이름을 지어줘 보자

In [10]:
my_df = pd.DataFrame(two_dimensional_list, columns = ['name', 'english_score', 'math_score'], index = ['a', 'b', 'c', 'd'])
my_df

       name  english_score  math_score
a  dongwook             50          86
b    sineui             89          31
c   ikjoong             68          91
d   yoonsoo             88          75

colums 의 목록을 출력해보자

In [11]:
my_df.columns

Index(['name', 'english_score', 'math_score'], dtype='object')

rows 의 목록을 출력해보자

In [12]:
my_df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

my_df 의 데이터타입을 출력해보자

In [14]:
my_df.dtypes

name             object
english_score     int64
math_score        int64
dtype: object

name 칼럼에 값들의 데이터타입은 object  
english-score 칼럼의 값 데이터타입은 int64  
math_score 칼럼의 값 데이터타입은 int64  
dtype 칼럽의 값의 데이터타입은 object